cmsis-svd/cmsis-svd/data/Atmel/ATSAME70N20.svd
         </registers>
      </peripheral>
      <peripheral>
         <name>MCAN0</name>
         <version>11273G</version>
         <description>Controller Area Network</description>
         <groupName>MCAN</groupName>
         <prependToName>MCAN_</prependToName>
         <baseAddress>0x40030000</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0xFC</size>
            <usage>registers</usage>
         </addressBlock>
         <interrupt>
            <name>MCAN0_INT0</name>
            <value>35</value>
         </interrupt>
         <interrupt>
            <name>MCAN0_INT1</name>
            <value>36</value>
         </interrupt>
         <registers>
            <register>
               <name>MCAN_CUST</name>
               <description>Customer Register</description>
               <addressOffset>0x08</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>CSV</name>
                     <description>Customer-specific Value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MCAN_FBTP</name>
               <description>Fast Bit Timing and Prescaler Register</description>
               <addressOffset>0x0C</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>FSJW</name>
                     <description>Fast (Re) Synchronization Jump Width</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>FTSEG2</name>
                     <description>Fast Time Segment After Sample Point</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>FTSEG1</name>
                     <description>Fast Time Segment Before Sample Point</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>FBRP</name>
                     <description>Fast Baud Rate Prescaler</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>TDC</name>
                     <description>Transceiver Delay Compensation</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>TDCSelect</name>
                        <enumeratedValue>
                           <name>DISABLED</name>
                           <description>Transceiver Delay Compensation disabled.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ENABLED</name>
                           <description>Transceiver Delay Compensation enabled.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>TDCO</name>
                     <description>Transceiver Delay Compensation Offset</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MCAN_TEST</name>
               <description>Test Register</description>
               <addressOffset>0x10</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>LBCK</name>
                     <description>Loop Back Mode (read/write)</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>LBCKSelect</name>
                        <enumeratedValue>
                           <name>DISABLED</name>
                           <description>Reset value. Loop Back mode is disabled.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ENABLED</name>
                           <description>Loop Back mode is enabled (see Section 1.5.1.9).</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>TX</name>
                     <description>Control of Transmit Pin (read/write)</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>TXSelect</name>
                        <enumeratedValue>
                           <name>RESET</name>
                           <description>Reset value, CANTX controlled by the CAN Core, updated at the end of the CAN bit time.</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SAMPLE_POINT_MONITORING</name>
                           <description>Sample Point can be monitored at pin CANTX.</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DOMINANT</name>
                           <description>Dominant ('0') level at pin CANTX.</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RECESSIVE</name>
                           <description>Recessive ('1') at pin CANTX.</description>
                           <value>0x3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>RX</name>
                     <description>Receive Pin (read-only)</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TDCV</name>
                     <description>Transceiver Delay Compensation Value (read-only)</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MCAN_RWD</name>
               <description>RAM Watchdog Register</description>
               <addressOffset>0x14</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>WDC</name>
                     <description>Watchdog Configuration (read/write)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>WDV</name>
                     <description>Watchdog Value (read-only)</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MCAN_CCCR</name>
               <description>CC Control Register</description>
               <addressOffset>0x18</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>INIT</name>
                     <description>Initialization (read/write)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>INITSelect</name>
                        <enumeratedValue>
                           <name>DISABLED</name>
                           <description>Normal operation.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ENABLED</name>
                           <description>Initialization is started.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CCE</name>
                     <description>Configuration Change Enable (read/write, write protection)</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>CCESelect</name>
                        <enumeratedValue>
                           <name>PROTECTED</name>
                           <description>The processor has no write access to the protected configuration registers.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CONFIGURABLE</name>
                           <description>The processor has write access to the protected configuration registers (while MCAN_CCCR.INIT = '1').</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ASM</name>
                     <description>Restricted Operation Mode (read/write, write protection against '1')</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>ASMSelect</name>
                        <enumeratedValue>
                           <name>NORMAL</name>
                           <description>Normal CAN operation.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RESTRICTED</name>
                           <description>Restricted operation mode active.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CSA</name>
                     <description>Clock Stop Acknowledge (read-only)</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CSR</name>
                     <description>Clock Stop Request (read/write)</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>CSRSelect</name>
                        <enumeratedValue>
                           <name>NO_CLOCK_STOP</name>
                           <description>No clock stop is requested.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CLOCK_STOP</name>
                           <description>Clock stop requested. When clock stop is requested, first INIT and then CSA will be set after all pend-ing transfer requests have been completed and the CAN bus reached idle.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>MON</name>
                     <description>Bus Monitoring Mode (read/write, write protection against '1')</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>MONSelect</name>
                        <enumeratedValue>
                           <name>DISABLED</name>
                           <description>Bus Monitoring mode is disabled.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ENABLED</name>
                           <description>Bus Monitoring mode is enabled.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>DAR</name>
                     <description>Disable Automatic Retransmission (read/write, write protection)</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>DARSelect</name>
                        <enumeratedValue>
                           <name>AUTO_RETX</name>
                           <description>Automatic retransmission of messages not transmitted successfully enabled.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>NO_AUTO_RETX</name>
                           <description>Automatic retransmission disabled.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>TEST</name>
                     <description>Test Mode Enable (read/write, write protection against '1')</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>TESTSelect</name>
                        <enumeratedValue>
                           <name>DISABLED</name>
                           <description>Normal operation, MCAN_TEST register holds reset values.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ENABLED</name>
                           <description>Test mode, write access to MCAN_TEST register enabled.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CME</name>
                     <description>CAN Mode Enable (read/write, write protection)</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>CMESelect</name>
                        <enumeratedValue>
                           <name>ISO11898_1</name>
                           <description>CAN operation according to ISO11898-1 enabled</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>FD</name>
                           <description>CAN FD operation enabled</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CMR</name>
                     <description>CAN Mode Request (read/write)</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>CMRSelect</name>
                        <enumeratedValue>
                           <name>NO_CHANGE</name>
                           <description>No mode change</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>FD</name>
                           <description>Request CAN FD operation</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>FD_BITRATE_SWITCH</name>
                           <description>Request CAN FD operation with bit rate switching</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ISO11898_1</name>
                           <description>Request CAN operation according ISO11898-1</description>
                           <value>0x3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>FDO</name>
                     <description>CAN FD Operation (read-only)</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FDBS</name>
                     <description>CAN FD Bit Rate Switching (read-only)</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TXP</name>
                     <description>Transmit Pause (read/write, write protection)</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MCAN_BTP</name>
               <description>Bit Timing and Prescaler Register</description>
               <addressOffset>0x1C</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>SJW</name>
                     <description>(Re) Synchronization Jump Width</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>TSEG2</name>
                     <description>Time Segment After Sample Point</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>TSEG1</name>
                     <description>Time Segment Before Sample Point</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
                  <field>
                     <name>BRP</name>
                     <description>Baud Rate Prescaler</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>10</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MCAN_TSCC</name>
               <description>Timestamp Counter Configuration Register</description>
               <addressOffset>0x20</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>TSS</name>
                     <description>Timestamp Select</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>TSSSelect</name>
                        <enumeratedValue>
                           <name>ALWAYS_0</name>
                           <description>Timestamp counter value always 0x0000</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TCP_INC</name>
                           <description>Timestamp counter value incremented according to TCP</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>EXT_TIMESTAMP</name>
                           <description>External timestamp counter value used</description>
                           <value>0x2</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>TCP</name>
                     <description>Timestamp Counter Prescaler</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MCAN_TSCV</name>
               <description>Timestamp Counter Value Register</description>
               <addressOffset>0x24</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>TSC</name>
                     <description>Timestamp Counter (cleared on write)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
