cmsis-svd/cmsis-svd/data/Atmel/ATSAME70N20.svd
         </registers>
      </peripheral>
      <peripheral>
         <name>SSC</name>
         <version>6078O</version>
         <description>Synchronous Serial Controller</description>
         <groupName>SSC</groupName>
         <prependToName>SSC_</prependToName>
         <baseAddress>0x40004000</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0xEC</size>
            <usage>registers</usage>
         </addressBlock>
         <interrupt>
            <name>SSC</name>
            <value>22</value>
         </interrupt>
         <registers>
            <register>
               <name>SSC_CR</name>
               <description>Control Register</description>
               <addressOffset>0x0</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>RXEN</name>
                     <description>Receive Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RXDIS</name>
                     <description>Receive Disable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TXEN</name>
                     <description>Transmit Enable</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TXDIS</name>
                     <description>Transmit Disable</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SWRST</name>
                     <description>Software Reset</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SSC_CMR</name>
               <description>Clock Mode Register</description>
               <addressOffset>0x4</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>DIV</name>
                     <description>Clock Divider</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>12</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SSC_RCMR</name>
               <description>Receive Clock Mode Register</description>
               <addressOffset>0x10</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>CKS</name>
                     <description>Receive Clock Selection</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>CKSSelect</name>
                        <enumeratedValue>
                           <name>MCK</name>
                           <description>Divided Clock</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TK</name>
                           <description>TK Clock signal</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RK</name>
                           <description>RK pin</description>
                           <value>0x2</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CKO</name>
                     <description>Receive Clock Output Mode Selection</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <name>CKOSelect</name>
                        <enumeratedValue>
                           <name>NONE</name>
                           <description>None, RK pin is an input</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CONTINUOUS</name>
                           <description>Continuous Receive Clock, RK pin is an output</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TRANSFER</name>
                           <description>Receive Clock only during data transfers, RK pin is an output</description>
                           <value>0x2</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CKI</name>
                     <description>Receive Clock Inversion</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CKG</name>
                     <description>Receive Clock Gating Selection</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>CKGSelect</name>
                        <enumeratedValue>
                           <name>CONTINUOUS</name>
                           <description>None</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>EN_RF_LOW</name>
                           <description>Receive Clock enabled only if RF Low</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>EN_RF_HIGH</name>
                           <description>Receive Clock enabled only if RF High</description>
                           <value>0x2</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>START</name>
                     <description>Receive Start Selection</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>4</bitWidth>
                     <enumeratedValues>
                        <name>STARTSelect</name>
                        <enumeratedValue>
                           <name>CONTINUOUS</name>
                           <description>Continuous, as soon as the receiver is enabled, and immediately after the end of transfer of the previous data.</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TRANSMIT</name>
                           <description>Transmit start</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RF_LOW</name>
                           <description>Detection of a low level on RF signal</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RF_HIGH</name>
                           <description>Detection of a high level on RF signal</description>
                           <value>0x3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RF_FALLING</name>
                           <description>Detection of a falling edge on RF signal</description>
                           <value>0x4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RF_RISING</name>
                           <description>Detection of a rising edge on RF signal</description>
                           <value>0x5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RF_LEVEL</name>
                           <description>Detection of any level change on RF signal</description>
                           <value>0x6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RF_EDGE</name>
                           <description>Detection of any edge on RF signal</description>
                           <value>0x7</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CMP_0</name>
                           <description>Compare 0</description>
                           <value>0x8</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>STOP</name>
                     <description>Receive Stop Selection</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>STTDLY</name>
                     <description>Receive Start Delay</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>PERIOD</name>
                     <description>Receive Period Divider Selection</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SSC_RFMR</name>
               <description>Receive Frame Mode Register</description>
               <addressOffset>0x14</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>DATLEN</name>
                     <description>Data Length</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>LOOP</name>
                     <description>Loop Mode</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MSBF</name>
                     <description>Most Significant Bit First</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DATNB</name>
                     <description>Data Number per Frame</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>FSLEN</name>
                     <description>Receive Frame Sync Length</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>FSOS</name>
                     <description>Receive Frame Sync Output Selection</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <name>FSOSSelect</name>
                        <enumeratedValue>
                           <name>NONE</name>
                           <description>None, RF pin is an input</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>NEGATIVE</name>
                           <description>Negative Pulse, RF pin is an output</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>POSITIVE</name>
                           <description>Positive Pulse, RF pin is an output</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>LOW</name>
                           <description>Driven Low during data transfer, RF pin is an output</description>
                           <value>0x3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>HIGH</name>
                           <description>Driven High during data transfer, RF pin is an output</description>
                           <value>0x4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TOGGLING</name>
                           <description>Toggling at each start of data transfer, RF pin is an output</description>
                           <value>0x5</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>FSEDGE</name>
                     <description>Frame Sync Edge Detection</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>FSEDGESelect</name>
                        <enumeratedValue>
                           <name>POSITIVE</name>
                           <description>Positive Edge Detection</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>NEGATIVE</name>
                           <description>Negative Edge Detection</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>FSLEN_EXT</name>
                     <description>FSLEN Field Extension</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SSC_TCMR</name>
               <description>Transmit Clock Mode Register</description>
               <addressOffset>0x18</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>CKS</name>
                     <description>Transmit Clock Selection</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>CKSSelect</name>
                        <enumeratedValue>
                           <name>MCK</name>
                           <description>Divided Clock</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RK</name>
                           <description>RK Clock signal</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TK</name>
                           <description>TK pin</description>
                           <value>0x2</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CKO</name>
                     <description>Transmit Clock Output Mode Selection</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <name>CKOSelect</name>
                        <enumeratedValue>
                           <name>NONE</name>
                           <description>None, TK pin is an input</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CONTINUOUS</name>
                           <description>Continuous Transmit Clock, TK pin is an output</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TRANSFER</name>
                           <description>Transmit Clock only during data transfers, TK pin is an output</description>
                           <value>0x2</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CKI</name>
                     <description>Transmit Clock Inversion</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CKG</name>
                     <description>Transmit Clock Gating Selection</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>CKGSelect</name>
                        <enumeratedValue>
                           <name>CONTINUOUS</name>
                           <description>None</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>EN_TF_LOW</name>
                           <description>Transmit Clock enabled only if TF Low</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>EN_TF_HIGH</name>
                           <description>Transmit Clock enabled only if TF High</description>
                           <value>0x2</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>START</name>
                     <description>Transmit Start Selection</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>4</bitWidth>
                     <enumeratedValues>
                        <name>STARTSelect</name>
                        <enumeratedValue>
                           <name>CONTINUOUS</name>
                           <description>Continuous, as soon as a word is written in the SSC_THR (if Transmit is enabled), and immediately after the end of transfer of the previous data</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RECEIVE</name>
                           <description>Receive start</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TF_LOW</name>
                           <description>Detection of a low level on TF signal</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TF_HIGH</name>
                           <description>Detection of a high level on TF signal</description>
                           <value>0x3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TF_FALLING</name>
                           <description>Detection of a falling edge on TF signal</description>
                           <value>0x4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TF_RISING</name>
                           <description>Detection of a rising edge on TF signal</description>
                           <value>0x5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TF_LEVEL</name>
                           <description>Detection of any level change on TF signal</description>
                           <value>0x6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TF_EDGE</name>
                           <description>Detection of any edge on TF signal</description>
                           <value>0x7</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>STTDLY</name>
                     <description>Transmit Start Delay</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>PERIOD</name>
                     <description>Transmit Period Divider Selection</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
